jonahn/EE478/Capstone/PIC/PIC_SOURCES/h/p18f67j94.h
extern volatile far  unsigned char       RPOR4_5;
extern volatile far  union {
  struct {
    unsigned RPO4R:4;
    unsigned RPO5R:4;
  };
  struct {
    unsigned RPO4R0:1;
    unsigned RPO4R1:1;
    unsigned RPO4R2:1;
    unsigned RPO4R3:1;
    unsigned RPO5R0:1;
    unsigned RPO5R1:1;
    unsigned RPO5R2:1;
    unsigned RPO5R3:1;
  };
} RPOR4_5bits;
extern volatile far  unsigned char       RPOR6_7;
extern volatile far  union {
  struct {
    unsigned RPO6R:4;
    unsigned RPO7R:4;
  };
  struct {
    unsigned RPO6R0:1;
    unsigned RPO6R1:1;
    unsigned RPO6R2:1;
    unsigned RPO6R3:1;
    unsigned RPO7R0:1;
    unsigned RPO7R1:1;
    unsigned RPO7R2:1;
    unsigned RPO7R3:1;
  };
} RPOR6_7bits;
extern volatile far  unsigned char       RPOR8_9;
extern volatile far  union {
  struct {
    unsigned RPO8R:4;
    unsigned RPO9R:4;
  };
  struct {
    unsigned RPO8R0:1;
    unsigned RPO8R1:1;
    unsigned RPO8R2:1;
    unsigned RPO8R3:1;
    unsigned RPO9R0:1;
    unsigned RPO9R1:1;
    unsigned RPO9R2:1;
    unsigned RPO9R3:1;
  };
} RPOR8_9bits;
extern volatile far  unsigned char       RPOR10_11;
extern volatile far  union {
  struct {
    unsigned RPO10R:4;
    unsigned RPO11R:4;
  };
  struct {
    unsigned RPO10R0:1;
    unsigned RPO10R1:1;
    unsigned RPO10R2:1;
    unsigned RPO10R3:1;
    unsigned RPO11R0:1;
    unsigned RPO11R1:1;
    unsigned RPO11R2:1;
    unsigned RPO11R3:1;
  };
} RPOR10_11bits;
extern volatile far  unsigned char       RPOR12_13;
extern volatile far  union {
  struct {
    unsigned RPO12R:4;
    unsigned RPO13R:4;
  };
  struct {
    unsigned RPO12R0:1;
    unsigned RPO12R1:1;
    unsigned RPO12R2:1;
    unsigned RPO12R3:1;
    unsigned RPO13R0:1;
    unsigned RPO13R1:1;
    unsigned RPO13R2:1;
    unsigned RPO13R3:1;
  };
} RPOR12_13bits;
extern volatile far  unsigned char       RPOR14_15;
extern volatile far  union {
  struct {
    unsigned RPO14R:4;
    unsigned RPO15R:4;
  };
  struct {
    unsigned RPO14R0:1;
    unsigned RPO14R1:1;
    unsigned RPO14R2:1;
    unsigned RPO14R3:1;
    unsigned RPO15R0:1;
    unsigned RPO15R1:1;
    unsigned RPO15R2:1;
    unsigned RPO15R3:1;
  };
} RPOR14_15bits;
extern volatile far  unsigned char       RPOR16_17;
extern volatile far  union {
  struct {
    unsigned RPO16R:4;
    unsigned RPO17R:4;
  };
  struct {
    unsigned RPO16R0:1;
    unsigned RPO16R1:1;
    unsigned RPO16R2:1;
    unsigned RPO16R3:1;
    unsigned RPO17R0:1;
    unsigned RPO17R1:1;
    unsigned RPO17R2:1;
    unsigned RPO17R3:1;
  };
} RPOR16_17bits;
extern volatile far  unsigned char       RPOR18_19;
extern volatile far  union {
  struct {
    unsigned RPO18R:4;
    unsigned RPO19R:4;
  };
  struct {
    unsigned RPO18R0:1;
    unsigned RPO18R1:1;
    unsigned RPO18R2:1;
    unsigned RPO18R3:1;
    unsigned RPO19R0:1;
    unsigned RPO19R1:1;
    unsigned RPO19R2:1;
    unsigned RPO19R3:1;
  };
} RPOR18_19bits;
extern volatile far  unsigned char       RPOR20_21;
extern volatile far  union {
  struct {
    unsigned RPO20R:4;
    unsigned RPO21R:4;
  };
  struct {
    unsigned RPO20R0:1;
    unsigned RPO20R1:1;
    unsigned RPO20R2:1;
    unsigned RPO20R3:1;
    unsigned RPO21R0:1;
    unsigned RPO21R1:1;
    unsigned RPO21R2:1;
    unsigned RPO21R3:1;
  };
} RPOR20_21bits;
extern volatile far  unsigned char       RPOR22_23;
extern volatile far  union {
  struct {
    unsigned RPO22R:4;
    unsigned RPO23R:4;
  };
  struct {
    unsigned RPO22R0:1;
    unsigned RPO22R1:1;
    unsigned RPO22R2:1;
    unsigned RPO22R3:1;
    unsigned RPO23R0:1;
    unsigned RPO23R1:1;
    unsigned RPO23R2:1;
    unsigned RPO23R3:1;
  };
} RPOR22_23bits;
extern volatile far  unsigned char       RPOR24_25;
extern volatile far  union {
  struct {
    unsigned RPO24R:4;
    unsigned RPO25R:4;
  };
  struct {
    unsigned RPO24R0:1;
    unsigned RPO24R1:1;
    unsigned RPO24R2:1;
    unsigned RPO24R3:1;
    unsigned RPO25R0:1;
    unsigned RPO25R1:1;
    unsigned RPO25R2:1;
    unsigned RPO25R3:1;
  };
} RPOR24_25bits;
extern volatile far  unsigned char       RPOR26_27;
extern volatile far  union {
  struct {
    unsigned RPO26R:4;
    unsigned RPO27R:4;
  };
  struct {
    unsigned RPO26R0:1;
    unsigned RPO26R1:1;
    unsigned RPO26R2:1;
    unsigned RPO26R3:1;
    unsigned RPO27R0:1;
    unsigned RPO27R1:1;
    unsigned RPO27R2:1;
    unsigned RPO27R3:1;
  };
} RPOR26_27bits;
extern volatile far  unsigned char       RPOR28_29;
extern volatile far  union {
  struct {
    unsigned RPO28R:4;
    unsigned RPO29R:4;
  };
  struct {
    unsigned RPO28R0:1;
    unsigned RPO28R1:1;
    unsigned RPO28R2:1;
    unsigned RPO28R3:1;
    unsigned RPO29R0:1;
    unsigned RPO29R1:1;
    unsigned RPO29R2:1;
    unsigned RPO29R3:1;
  };
} RPOR28_29bits;
extern volatile far  unsigned char       RPOR30_31;
extern volatile far  union {
  struct {
    unsigned RPO30R:4;
    unsigned RPO31R:4;
  };
  struct {
    unsigned RPO30R0:1;
    unsigned RPO30R1:1;
    unsigned RPO30R2:1;
    unsigned RPO30R3:1;
    unsigned RPO31R0:1;
    unsigned RPO31R1:1;
    unsigned RPO31R2:1;
    unsigned RPO31R3:1;
  };
} RPOR30_31bits;
extern volatile far  unsigned char       RPOR32_33;
extern volatile far  union {
  struct {
    unsigned RPO32R:4;
    unsigned RPO33R:4;
  };
  struct {
    unsigned RPO32R0:1;
    unsigned RPO32R1:1;
    unsigned RPO32R2:1;
    unsigned RPO32R3:1;
    unsigned RPO33R0:1;
    unsigned RPO33R1:1;
    unsigned RPO33R2:1;
    unsigned RPO33R3:1;
  };
} RPOR32_33bits;
extern volatile far  unsigned char       RPOR34_35;
extern volatile far  union {
  struct {
    unsigned RPO34R:4;
    unsigned RPO35R:4;
  };
  struct {
    unsigned RPO34R0:1;
    unsigned RPO34R1:1;
    unsigned RPO34R2:1;
    unsigned RPO34R3:1;
    unsigned RPO35R0:1;
    unsigned RPO35R1:1;
    unsigned RPO35R2:1;
    unsigned RPO35R3:1;
  };
} RPOR34_35bits;
extern volatile far  unsigned char       RPOR36_37;
extern volatile far  union {
  struct {
    unsigned RPO36R:4;
    unsigned RPO37R:4;
  };
  struct {
    unsigned RPO36R0:1;
    unsigned RPO36R1:1;
    unsigned RPO36R2:1;
    unsigned RPO36R3:1;
    unsigned RPO37R0:1;
    unsigned RPO37R1:1;
    unsigned RPO37R2:1;
    unsigned RPO37R3:1;
  };
} RPOR36_37bits;
extern volatile far  unsigned char       RPOR38_39;
extern volatile far  union {
  struct {
    unsigned RPO38R:4;
    unsigned RPO39R:4;
  };
  struct {
    unsigned RPO38R0:1;
    unsigned RPO38R1:1;
    unsigned RPO38R2:1;
    unsigned RPO38R3:1;
    unsigned RPO39R0:1;
    unsigned RPO39R1:1;
    unsigned RPO39R2:1;
    unsigned RPO39R3:1;
  };
} RPOR38_39bits;
extern volatile far  unsigned char       RPOR40_41;
extern volatile far  union {
  struct {
    unsigned RPO40R:4;
    unsigned RPO41R:4;
  };
  struct {
    unsigned RPO40R0:1;
    unsigned RPO40R1:1;
    unsigned RPO40R2:1;
    unsigned RPO40R3:1;
    unsigned RPO41R0:1;
    unsigned RPO41R1:1;
    unsigned RPO41R2:1;
    unsigned RPO41R3:1;
  };
} RPOR40_41bits;
extern volatile far  unsigned char       RPOR42_43;
extern volatile far  union {
  struct {
    unsigned RPO42R:4;
    unsigned RPO43R:4;
  };
  struct {
    unsigned RPO42R0:1;
    unsigned RPO42R1:1;
    unsigned RPO42R2:1;
    unsigned RPO42R3:1;
    unsigned RPO43R0:1;
    unsigned RPO43R1:1;
    unsigned RPO43R2:1;
    unsigned RPO43R3:1;
  };
} RPOR42_43bits;
extern volatile far  unsigned char       RPOR44_45;
extern volatile far  union {
  struct {
    unsigned RPO44R:4;
    unsigned RPO45R:4;
  };
  struct {
    unsigned RPO44R0:1;
    unsigned RPO44R1:1;
    unsigned RPO44R2:1;
    unsigned RPO44R3:1;
    unsigned RPO45R0:1;
    unsigned RPO45R1:1;
    unsigned RPO45R2:1;
    unsigned RPO45R3:1;
  };
} RPOR44_45bits;
extern volatile far  unsigned char       RPOR46;
extern volatile far  union {
  struct {
    unsigned RPO46R:4;
  };
  struct {
    unsigned RPO46R0:1;
    unsigned RPO46R1:1;
    unsigned RPO46R2:1;
    unsigned RPO46R3:1;
  };
} RPOR46bits;
